<?php
    /**
     *
     * Chuyển đổi chuỗi kí tự thành dạng slug dùng cho việc tạo friendly url.
     *
     * @access    public
     * @param    string
     * @return    string
     */
    if ( ! function_exists('create_slug'))
    {
         function create_slug($string) {
               $trans = array (','=> '-','à' => 'a', 'á' => 'a', 'ả' => 'a', 'ầ'=>'a', 'ắ'=>'a','&'=>'-',
                'ã' => 'a', 'ạ' => 'a', 'â' => 'a', 'ấ' => 'a', 
                'ầ' => 'a', 'ẫ' => 'a', 'ẩ' => 'a', 'ậ' => 'a', 
                'ú' => 'a', 'ù' => 'u', 'ủ' => 'u', 'ũ' => 'u', 
                'ụ' => 'u', 'à' => 'a', 'á' => 'a', 'ô' => 'o', 
                'ố' => 'o', 'ồ' => 'o', 'ổ' => 'o', 'ỗ' => 'o', 
                'ộ' => 'o', 'ó' => 'o', 'ò' => 'o', 'ỏ' => 'o',
                 'õ' => 'o', 'ọ' => 'o', 'ê' => 'e', 'ế' => 'e',
                  'ề' => 'e', 'ể' => 'e', 'ễ' => 'e', 'ệ' => 'e',
                   'í' => 'i', 'ì' => 'i', 'ỉ' => 'i', 'ĩ' => 'i', 
                   'ị' => 'i', 'ơ' => 'o', 'ớ' => 'o', 'ý' => 'y',
                    'ỳ' => 'y', 'ỷ' => 'y', 'ỹ' => 'y', 'ỵ' => 'y',
                     'ờ' => 'o', 'ở' => 'o', 'ỡ' => 'o', 'ợ' => 'o',
                      'ư' => 'u', 'ừ' => 'u', 'ứ' => 'u', 'ử' => 'u',
                       'ữ' => 'u', 'ự' => 'u', 'đ' => 'd', 'À' => 'A',
                        'Á' => 'A', 'Ả' => 'A', 'Ã' => 'A', 'Ạ' => 'A',
                         'Â' => 'A', 'Ấ' => 'A', 'À' => 'A', 'Ẫ' => 'A','Ầ' =>'A',
                          'Ẩ' => 'A', 'Ậ' => 'A', 'Ú' => 'U', 'Ù' => 'U',
                           'Ủ' => 'U', 'Ũ' => 'U', 'Ụ' => 'U', 'Ô' => 'O',
                            'Ố' => 'O', 'Ồ' => 'O', 'Ổ' => 'O', 'Ỗ' => 'O',
                             'Ộ' => 'O', 'Ê' => 'E', 'Ế' => 'E', 'Ề' => 'E',
                              'Ể' => 'E', 'Ễ' => 'E', 'Ệ' => 'E', 'Í' => 'I','ẹ' => 'e',
                               'Ì' => 'I', 'Ỉ' => 'I', 'Ĩ' => 'I', 'Ị' => 'I','è'=>'e',
                                'Ơ' => 'O', 'Ớ' => 'O', 'Ờ' => 'O', 'Ở' => 'O', 
                                'Ỡ' => 'O', 'Ợ' => 'O', 'Ư' => 'U', 'Ừ' => 'U','Ọ'=>'O','Ò' =>'O',
                                 'Ứ' => 'U', 'Ử' => 'U', 'Ữ' => 'U', 'Ự' => 'U', 'Đ' => 'D', 'Ý' => 'Y', 'Ỳ' => 'Y', 'Ỷ' => 'Y', 'Ỹ' => 'Y', 'Ỵ' => 'Y',  'á' => 'a', 'à' => 'a', 'ả' => 'a', 'ã' => 'a', 'ạ' => 'a', 'ă' => 'a', 'ắ' => 'a', 'ằ' => 'a', 'ẳ' => 'a', 'ẵ' => 'a', 'ặ' => 'a', 'â' => 'a', 'ấ' => 'a', 'ầ' => 'a', 'ẩ' => 'a', 'ẫ' => 'a', 'ậ' => 'a', 'ú' => 'u', 'ù' => 'u', 'ủ' => 'u', 'ũ' => 'u', 'ụ' => 'u', 'ư' => 'u', 'ứ' => 'u', 'ừ' => 'u', 'ử' => 'u', 'ữ' => 'u', 'ự' => 'u', 'í' => 'i', 'ì' => 'i', 'ỉ' => 'i', 'ĩ' => 'i', 'ị' => 'i', 'ó' => 'o', 'ò' => 'o', 'ỏ' => 'o', 'õ' => 'o', 'ọ' => 'o', 'ô' => 'o', 'ố' => 'o', 'ồ' => 'ô', 'ổ' => 'o', 'ỗ' => 'o', 'ộ' => 'o', 'ế'=>'e', 'ệ'=>'e','ơ' => 'o', 'ớ' => 'o', 'ờ' => 'o', 'ở' => 'o', 'ỡ' => 'o', 'ợ' => 'o', 'đ' => 'd', 'Đ' => 'D', 'ý' => 'y', 'ỳ' => 'y', 'ỷ' => 'y', 'ỹ' => 'y', 'ỵ' => 'y', 'Á' => 'A', 'À' => 'A', 'Ả' => 'A', 'Ã' => 'A', 'Ạ' => 'A', 'Ă' => 'A', 'Ắ' => 'A', 'Ẳ' => 'A', 'Ẵ' => 'A', 'Ặ' => 'A', 'Â' => 'A', 'Ấ' => 'A', 'Ẩ' => 'A', 'Ẫ' => 'A', 'Ậ' => 'A', 'É' => 'E', 'È' => 'E', 'Ẻ' => 'E', 'Ẽ' => 'E', 'Ẹ' => 'E', 'Ế' => 'E', 'Ề' => 'E', 'Ể' => 'E', 'ể'=>'e','Ễ' => 'E', 'Ệ' => 'E', 'Ú' => 'U', 'Ù' => 'U', 'Ủ' => 'U', 'Ũ' => 'U', 'Ụ' => 'U', 'Ư' => 'U', 'Ứ' => 'U', 'Ừ' => 'U', 'Ử' => 'U', 'Ữ' => 'U', 'Ự' => 'U', 'Í' => 'I', 'Ì' => 'I', 'Ỉ' => 'I', 'Ĩ' => 'I', 'Ị' => 'I', 'Ó' => 'O', 'Ò' => 'O', 'Ỏ' => 'O', 'Õ' => 'O', 'Ọ' => 'O', 'Ô' => 'O', 'Ố' => 'O', 'Ổ' => 'O', 'Ỗ' => 'O', 'Ộ' => 'O', 'Ơ' => 'O', 'Ớ' => 'O', 'Ờ' => 'O', 'Ở' => 'O', 'Ỡ' => 'O', 'Ợ' => 'O', 'Ý' => 'Y', 'Ỳ' => 'Y', 'Ỷ' => 'Y', 'Ỹ' => 'Y', 'Ỵ' => 'Y', ' ' => '-' ); 

                return strtr ( $string, $trans );
            }
        }
?>